{
  "jobs": [
    {
      "id": "1",
      "title": "Senior React Developer",
      "type": "Full-Time",
      "description": "We are seeking a talented Front-End Developer to join our team in Berlin, Germany. The ideal candidate will have strong skills in HTML, CSS, and JavaScript, with experience working with modern JavaScript frameworks such as React or Angular.",
      "location": "Berlin, Germany",
      "salary": "€70K - €80K",
      "company": {
        "name": "TechWave Solutions",
        "description": "TechWave Solutions is a leading technology company specializing in web development and digital solutions. We pride ourselves on delivering high-quality products and services to our clients while fostering a collaborative and innovative work environment.",
        "contactEmail": "contact@techwave.com",
        "contactPhone": "555-111-2222"
      }
    },
    {
      "id": "2",
      "title": "Front-End Engineer (React & Redux)",
      "type": "Full-Time",
      "location": "Lisbon, Portugal",
      "description": "Join our team as a Front-End Developer in sunny Lisbon, Portugal. We are looking for a motivated individual with a passion for crafting beautiful and responsive web applications. Experience with UI/UX design principles and a strong attention to detail are highly desirable.",
      "salary": "€65K - €75K",
      "company": {
        "name": "PixelDesign Studio",
        "description": "PixelDesign Studio is a creative agency specializing in digital design and development. Our team is dedicated to pushing the boundaries of creativity and innovation to deliver exceptional results for our clients.",
        "contactEmail": "contact@pixeldesign.com",
        "contactPhone": "555-333-4444"
      }
    },
    {
      "id": "3",
      "title": "React.js Developer",
      "type": "Full-Time",
      "location": "Amsterdam, Netherlands",
      "description": "Are you passionate about front-end development? Join our team in vibrant Amsterdam, Netherlands, and work on exciting projects that make a difference. We offer competitive compensation and a collaborative work environment where your ideas are valued.",
      "salary": "€60K - €70K",
      "company": {
        "name": "CloudNet Solutions",
        "description": "CloudNet Solutions is a leading technology company specializing in digital solutions for businesses of all sizes. With a focus on innovation and customer satisfaction, we are committed to delivering cutting-edge products and services.",
        "contactEmail": "contact@cloudnet.com",
        "contactPhone": "555-777-8888"
      }
    },
    {
      "id": "4",
      "title": "Full Stack React Developer",
      "type": "Full-Time",
      "description": "Exciting opportunity for a Full-Time Full Stack Developer in bustling Paris, France. We are seeking a talented individual with a passion for building elegant and scalable web applications. Join our team and make an impact!",
      "location": "Paris, France",
      "salary": "€90K - €100K",
      "company": {
        "name": "NextGen Technologies",
        "description": "NextGen Technologies is a rapidly growing technology company specializing in e-commerce solutions. We offer a dynamic and collaborative work environment where employees are encouraged to think creatively and innovate.",
        "contactEmail": "contact@nextgen.com",
        "contactPhone": "555-999-0000"
      }
    },
    {
      "id": "5",
      "title": "React Native Developer",
      "type": "Remote",
      "location": "Copenhagen, Denmark",
      "description": "Join our team as a Front-End Developer in beautiful Copenhagen, Denmark. We are looking for a skilled and enthusiastic individual to help us create innovative web solutions. Competitive salary and great benefits package available.",
      "salary": "€100K - €110K",
      "company": {
        "name": "NordicTech Solutions",
        "description": "NordicTech Solutions is a leading technology company specializing in software development and digital marketing. We are committed to providing our clients with cutting-edge solutions and our employees with a supportive and rewarding work environment.",
        "contactEmail": "contact@nordictech.com",
        "contactPhone": "555-444-5555"
      }
    },
    {
      "id": "6",
      "title": "Senior Full-Stack Developer",
      "type": "Full-Time",
      "location": "Barcelona, Spain",
      "description": "We are seeking a highly skilled Senior Full-Stack Developer to join our dynamic team in Barcelona, Spain. The ideal candidate will have expertise in both front-end and back-end development, with a strong emphasis on React and Node.js.",
      "salary": "€120K - €130K",
      "company": {
        "name": "CodeCraft Labs",
        "description": "CodeCraft Labs is a forward-thinking software company focused on building modern web and mobile applications. Our team thrives in a collaborative environment, and we strive for excellence in everything we do.",
        "contactEmail": "contact@codecraftlabs.com",
        "contactPhone": "555-666-7777"
      }
    },
    {
      "id": "060c",
      "title": "gfhgfh",
      "type": "Full-Time",
      "location": "fghgfh",
      "description": "fghfgh",
      "salary": "Under €50K",
      "company": {
        "name": "",
        "description": "",
        "contactEmail": "fgh@sdfgfd.com",
        "contactPhone": ""
      }
    }
  ]
}